{
    "title": "HOW TO BUILD AN KICK-ASS PORTFOLIO FOR DATA SCIENCE",
    "content": "<pre>\r\n<code>Introduction\r\nGone are the days, when people just used to view CV and decide whether you’re a suitable candidate for an internship or job. In the technological sector, people now see the overall profile and projects (Portfolio) to shortlist candidates, especially for Data Science. But with time, educational companies have started to provide paid online projects, so,  almost every student is now doing projects and internships (paid\/unpaid\/voluntary).\r\n\r\nSo, the candidates should not only proactively do projects but also showcase their skills to stand out for an opportunity. By showcasing I mean you should make a brand of yourself. When someone sees your data science portfolio, they should get an exact idea of your interests, previous work, accomplishments and be interested in having a talk with you.\r\n\r\n \r\n\r\nTips to Make an Amazing Data Science Portfolio\r\n1. Have an active Github profile\r\nGitHub allows you to host a remote version of your project where others can see it and even collaborate to form a better version. Always have an active GitHub profile and put the link on your CV. By active profile, I mean you should work on it regularly because your contributions on daily basis are recorded on it and can be seen by viewers. Also, make sure to make a readme.md (read more about it at ) for your profile to customize your homepage.\r\n\r\nHere is a sample of my profile to get an idea:\r\n\r\nGithub profile\r\nContributions\r\n \r\n\r\nLoading Image\r\nData Science Immersive Bootcamp\r\nA program that trains you to be an industry-ready data scientist within 240 Days\r\n2. Start Using Kaggle\r\nHaving a Kaggle account is very important. Not only for displaying your skills but also for practicing them regularly. Many companies like ZS Analytics, KPMG, Bain &amp; Co., JPM, etc. have a Data Science Competition like the ones available on Kaggle.\r\n\r\nApart from this, the learning competitions available on Kaggle helps to understand more about the techniques and tips to apply when dealing with different kinds of data. Kaggle is also a great platform to showcase your skills. You can learn medals and titles (Kaggle 1X\/2X\/3X\/4X Expert, Kaggle Grandmaster) which have a great impact if you put them on the headline of your LinkedIn profile. You can also add a link to Kaggle on your CV.\r\n\r\nBelow is a random public profile of a Kaggle 3X expert from India,\r\n\r\n \r\n\r\nData Science Portfolio Kaggle\r\n \r\n\r\n3. Participate in Competitions and Hackathons\r\nCompetitions and Hackathons help us to develop our skills and know our position in our peer group. Success in competitions and hackathons can be put as achievements that will add credibility to your work. For example, the Analytics Vidhya platform can be used to participate in Hackathons. Top Approaches of any competition can also be viewed on it to learn new and improved approaches.\r\n\r\nRight now, you participate in around 67 hackathons on it for learning purposes and see the top approaches for previous competitions. They also have Job-A-thons and hiring hackathons several times a year, so stay tuned with them to participate in those.\r\n\r\nData Sciecne Hackathons\r\n \r\n\r\n \r\n\r\n4. Practice questions using HackerRank\r\nHackerRank is a great platform to enhance your Python skills. It has questions that can help you improve your programming skills. Along with this, it also offers stars based on points you achieve for solving those questions correctly. Put ( HackerRank 5 star) on your LinkedIn headline to show their competence in Python or Data Structures\/Algorithms.\r\n\r\nData Science Portfolio Practice\r\n \r\n\r\n5. Read Blogs\r\nReading blogs keeps you updated about recent developments in the field. They might also be helpful in discussions during the interview. Also, blogs can be used as a tool to learn new skills. Reading blogs on personal experiences would help you to learn more about the industry and what you should do to find a suitable role in the future. You can follow Christopher Zita, Analytics India Magazine, Analytics Vidhya Blog\/Medium Channel, Towards Data Science (On Medium), KDnuggets, etc. for this purpose.\r\n\r\n \r\n\r\n6. Make your portfolio website\r\nMake a very simple portfolio website. You can either code in HTML or use Wix\/Weebly for making one. Once, you host your website, make sure you put it on your CV too. A website will have a great impact on a recruiter who sees your profile. It will enhance your skills and also give an opportunity to them to see your projects and work in the field. The image below shows a snapshot of my portfolio website.\r\n\r\nData Science portfolio website\r\n \r\n\r\n7. Have a LinkedIn profile\r\nA Linkedin profile is extremely important for everyone. This helps you to connect with people from all over the world who might be working in the field you’re interested in. LinkedIn also helps in sharing your work with the community. Many recruiters now use LinkedIn’s recommendation system to contact candidates for any openings in their firms. Also, follow hashtags in the field of DS and ML-like  #66daysofdata, #MavenAnalytics (For Data Visualisation).\r\n\r\n \r\n\r\n8. Do small projects\r\nStart with projects on well-known datasets like Boston Pricing, Iris, XOR, MNIST, etc. After this move on to making big projects like recommendation engine, full analysis of some data, etc. Datasets can be found on Kaggle. HR analytics, Image Analysis, Customer Segmentation, Netflix Data Analysis, Uber Data Analysis are some examples to start projects. Feel free to make your own dataset and then do an analysis.\r\n\r\n \r\n\r\n9. Deploy code\r\nOnce you’ve made a project, then try to deploy it either on Heroku or AWS or any other cloud platform. This helps you to build a full-fledged data science application that can be used. For example, if you make a movie recommendation engine, then using Heroku or AWS, build a website where people can actually come, choose movies they like and your algorithm predicts which movies they can watch based on their interests. This code deploying impresses HR’s a lot and can surely help you to score an interview.\r\n\r\n \r\n\r\n10. Focus on community building\r\nThe above methods will surely help you to build an extremely great profile, but apart from it, knowing opportunities is also important. For this, participate in the community and build great connections. LinkedIn, Discord, Slack, Telegram are some platforms where you can join groups of data scientists who regularly post messages for opportunities that you can make use of.\r\n\r\nI hope you liked this article.<\/code><\/pre>\r\n\r\n<p>&nbsp;<\/p>\r\n",
    "author": "Kishan bhai",
    "metadesc": "Gone are the days, when people just used to view CV and decide whether you’re a suitable candidate for an internship or job. In the technological sector, people now see the overall profile and projects (Portfolio) to shortlist candidates, especially for Data Science. But with time, educational companies have started to provide paid online projects, so, almost every student is now doing projects and internships (paid/unpaid/voluntary).....",
    "slug": "data-scientist-3"
}